; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph4 - mode
	thermograph2 - mode
	infrared0 - mode
	image1 - mode
	image6 - mode
	spectrograph5 - mode
	image3 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image3)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star4)
	(supports instrument2 image6)
	(supports instrument2 spectrograph5)
	(supports instrument2 image3)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared0)
	(supports instrument3 image3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star3)
	(supports instrument5 image6)
	(calibration_target instrument5 Star3)
	(supports instrument6 image6)
	(supports instrument6 image3)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(have_image Phenomenon5 image6)
	(have_image Phenomenon5 image3)
	(have_image Star6 image6)
	(have_image Star7 infrared0)
	(have_image Planet8 spectrograph5)
	(have_image Star9 infrared0)
	(have_image Star10 thermograph2)
	(have_image Star10 infrared0)
	(have_image Star11 thermograph4)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon13 thermograph2)
))

)

; plan
1. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 0 of 12
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite0 star6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star6)
   goals met: 0 of 12
5. (take_image satellite0 star6 instrument2 image6)
   added: (have_image star6 image6)
   goals met: 1 of 12
6. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   goals met: 1 of 12
7. (take_image satellite0 planet8 instrument2 spectrograph5)
   added: (have_image planet8 spectrograph5)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon5 instrument2 image6)
   added: (have_image phenomenon5 image6)
   goals met: 3 of 12
10. (take_image satellite0 phenomenon5 instrument2 image3)
   added: (have_image phenomenon5 image3)
   goals met: 4 of 12
11. (turn_to satellite0 groundstation0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 12
12. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 4 of 12
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 12
14. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 12
15. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 12
16. (turn_to satellite0 star11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star11)
   goals met: 4 of 12
17. (take_image satellite0 star11 instrument0 thermograph4)
   added: (have_image star11 thermograph4)
   goals met: 5 of 12
18. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 5 of 12
19. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 6 of 12
20. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 6 of 12
21. (take_image satellite0 star9 instrument0 infrared0)
   added: (have_image star9 infrared0)
   goals met: 7 of 12
22. (turn_to satellite1 star3 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star3)
   goals met: 7 of 12
23. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 7 of 12
24. (turn_to satellite1 phenomenon12 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon12)
   goals met: 7 of 12
25. (take_image satellite1 phenomenon12 instrument3 image1)
   added: (have_image phenomenon12 image1)
   goals met: 8 of 12
26. (take_image satellite1 phenomenon12 instrument3 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 9 of 12
27. (turn_to satellite1 phenomenon13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon13)
   goals met: 9 of 12
28. (take_image satellite1 phenomenon13 instrument3 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 10 of 12
29. (turn_to satellite1 star10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star10)
   goals met: 10 of 12
30. (take_image satellite1 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 11 of 12
31. (take_image satellite1 star10 instrument3 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 12 of 12
